NordicPlayground/nrf51-ble-tutorial-advertising/main.c
    // Initialize the SoftDevice handler module using the low frequency crystal oscillator with 20 ppm accuracy
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_XTAL_20_PPM, NULL);

    // Enable BLE stack 
	// Declaration of a simple struct containing ble parameters
    ble_enable_params_t ble_enable_params;
	
	// Always initialize all fields in structs to zero or you might get unexpected behaviour
    memset(&ble_enable_params, 0, sizeof(ble_enable_params));
	
	// This parameter defines whether or not our device might reconfigure its services during its lifetime. 
	// In our case we set the value to 0 meaning that no service or attributes will ever change.
    ble_enable_params.gatts_enable_params.service_changed = IS_SRVC_CHANGED_CHARACT_PRESENT;
	
	// This call initializes the bluetooth stack, no other BLE related call can be called before this one has been executed.
    err_code = sd_ble_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);// Check for errors
    
    // Tell the softdevice which function is to be called i case of a BLE event. In this case: ble_evt_dispatch()
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);// Check for errors
    
//    // Register with the SoftDevice handler module for BLE events.
//    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
//    APP_ERROR_CHECK(err_code);// Check for errors
}


/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}


/**@brief Function for handling a bsp event.
 *
 * @param[in]     evt                        BSP event.
 */
/* YOUR_JOB: Uncomment this function if you need to handle button events.
static void bsp_event_handler(bsp_event_t evt)
{
        switch (evt)
        {
            case BSP_EVENT_KEY_0:
                // Code to handle BSP_EVENT_KEY_0
                break;

            // Handle any other event

            default:
                APP_ERROR_HANDLER(evt);
                break;
        }
    }
}
*/


/**@brief Function for initializing the GPIOTE handler module.
 */
static void gpiote_init(void)
{
    APP_GPIOTE_INIT(APP_GPIOTE_MAX_USERS);
}


/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{   
        uint32_t err_code; // Variable used to check for any errors returned by functions
        // Note: Before start using buttons, assign events to buttons, as shown below.
        //      err_code = bsp_event_to_button_assign(BUTTON_0_ID, BSP_EVENT_KEY_0);
        //      APP_ERROR_CHECK(err_code);// Check for errors
        // Note: Enable buttons which you want to use.
        //      err_code = bsp_buttons_enable((1 << WAKEUP_BUTTON_ID) | (1 << BUTTON_0_ID)); 
        //      APP_ERROR_CHECK(err_code);// Check for errors
        // Note: If the only use of buttons is to wake up, the bsp module can be omitted, and
        // the wakeup button can be configured by
        err_code = bsp_buttons_enable(1 << WAKEUP_BUTTON_ID);
        APP_ERROR_CHECK(err_code);// Check for errors
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);// Check for errors
}


/**@brief Function for initializing bsp module.
 */
static void bsp_module_init(void)
{
        uint32_t err_code; // Variable used to check for any errors returned by functions
        // Note: If the only use of buttons is to wake up, bsp_event_handler can be NULL.
        err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), NULL);
        APP_ERROR_CHECK(err_code);// Check for errors
        // Note: If the buttons will be used to do some task, assign bsp_event_handler, as shown below.
        // err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), bsp_event_handler);
        // APP_ERROR_CHECK(err_code);// Check for errors
        // Buttons initialization.
        buttons_init();
}


/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize
    timers_init();
    //gpiote_init();
    ble_stack_init();
    //bsp_module_init();
    scheduler_init();
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();
    //sec_params_init();

    // Start execution
    timers_start();
    advertising_start();

    // Enter main loop
    for (;;)
    {
        app_sched_execute();
        power_manage();
    }
}

/**
 * @}
 */
